using System;
using System.Collections.Generic;
using System.Text;
using static System.Console;
namespace ПодіїІспитів
{
    public delegate void ДелегатІспита(string варіант);
    class Студент
    {
        public string прізвище { get; set; }
        public int id { get; set; }

        public void іспит(string завдання)
        {
            WriteLine($"Студент {прізвище} виконав {завдання}");
        }
    }
    class Викладач
    {
        public string прізвище { get; set; }
        public ДелегатІспита ПодіяІспита_v1;
        public ДелегатІспита ПодіяІспита_v2;
        public void іспит(string завдання)
        {

        }
    }
    class Програма
    {
        static void Main(string[] args)
        {
            List<Студент> група = new List<Студент> {
  new Студент
  {
  прізвище = "Василіу Андрій",
  id = 1
  },
  new Студент
  {
  прізвище = "Деревянко Тетяна",
  id = 2
  },
  new Студент
  {
  прізвище = "Козар Нікіта",
  id = 3
  },
  new Студент
  {
  прізвище = "Марциняк Володимир",
  id = 4
  },
  new Студент
  {
  прізвище = "Лакуста Олексій",
  id = 5
  },
    new Студент
  {
  прізвище = "Меленко Олександр",
  id = 6
  },
  new Студент
  {
  прізвище = "Григорець Єгор",
  id = 7
  },
  new Студент
  {
  прізвище = "Ботнарь Артем",
  id = 8
  },
  new Студент
  {
  прізвище = "Василіу Олександр",
  id = 9
  },
  new Студент
  {
  прізвище = "Олексюк Ірина",
  id = 10
  },
    new Студент
  {
  прізвище = "Чумак Андрій",
  id = 11
  },
  new Студент
  {
  прізвище = "Петрюк Даниїл",
  id = 12
  },
 };
            Викладач викладач = new Викладач();
            foreach (Студент студент in група)
            {
                if (студент.id % 2 == 0)
                {
                    викладач.ПодіяІспита_v2 += студент.іспит;
                }
                if (студент.id % 2 == 1)
                {
                    викладач.ПодіяІспита_v1 += студент.іспит;
                }
            }
            // виклик події напряму
            Console.OutputEncoding = Encoding.UTF8;
            викладач.ПодіяІспита_v1.Invoke("варіант 1");
            викладач.ПодіяІспита_v2.Invoke("варіант 2");             // нема події 
            викладач.іспит("Наступне завдання");     // не виконується
            Console.ReadKey();
        }
    }
}